#include <iostream>
using namespace std;

int main() {

    system("chcp 1251 > nul"); //підключення української мови

    // Введення двох дійсних змінних
    double a, b;
    cout << "Введіть значення змінної a: ";
    cin >> a;
    cout << "Введіть значення змінної b: ";
    cin >> b;

    // Оголошення покажчиків
    double* ptrA = &a;
    double* ptrB = &b;

    // Зміна значень через покажчики
    *ptrA *= 2; // Збільшення a в 2 рази
    *ptrB /= 2; // Зменшення b в 2 рази

    // Виведення результату
    cout << "Значення a після зміни: " << a << endl;
    cout << "Значення b після зміни: " << b << endl;

    return 0;
}
